[
  {
    "title": "Highway 1",
    "description": "Highway 1 (TransCanada Highway). Vehicle incident between Annis Rd and Exit 135 for 6.1 km (Chilliwack). Road closed. Detour in effect. Assessment in progress. Expect delays. Westbound detour: Exit 135 (Agassiz/Harrison Hot Springs) to Highway 9. Eastbound detour: Exit 129 (Annis Road) to Yale Road. Next update time Fri Nov 8 at 3:00 PM PST. Last updated Fri Nov 8 at 10:41 AM PST. (DBC-70096)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-70096.html",
    "Location": "Highway 1 (TransCanada Highway) between Annis Rd and Exit 135 for 6.1 km (Chilliwack)",
    "Description": "Vehicle incident, road closed, detour in effect, assessment in progress, expect delays. Westbound detour: Exit 135 (Agassiz/Harrison Hot Springs) to Highway 9. Eastbound detour: Exit 129 (Annis Road) to Yale Road.",
    "Next update time": "Fri Nov 8 at 3:00 PM PST",
    "Last update time": "Fri Nov 8 at 10:41 AM PST",
    "latitude": 49.1585097,
    "longitude": -121.8301722
  },
  {
    "title": "Highway 1 Both Directions",
    "description": "Highway 1 (TransCanada Highway), in both directions. Bridge construction at Nicomen River Rd (14 km east of Lytton). Until Sat Nov 30. Watch for traffic control. Expect delays. Speed reduced to 30 km/h. Highway stoppages with expected delays of 15 minutes. Project completion: 30 November 2024. Next update time Fri Nov 29 at 3:00 PM PDT. Last updated Fri Oct 25 at 5:08 AM PDT. (DBC-56391)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-56391.html",
    "Location": "Highway 1 (TransCanada Highway), Nicomen River Rd (14 km east of Lytton)",
    "Description": "Bridge construction with traffic control, speed reduced to 30 km/h, expect delays and highway stoppages with expected delays of 15 minutes.",
    "Next update time": "Fri Nov 29 at 3:00 PM PDT",
    "Last update time": "Fri Oct 25 at 5:08 AM PDT",
    "latitude": 50.2465353,
    "longitude": -121.5693214
  },
  {
    "title": "Highway 1 Both Directions",
    "description": "Highway 1 (TransCanada Highway), in both directions. Construction work between Coburn St and Shuswap Ave for 0.7 km (Chase). From 7:00 AM to 5:00 PM PDT on weekdays and Saturday. Blasting. Road closed intermittently. Watch for traffic control. Speed reduction to 60km/hr. Next update time Mon Nov 25 at 10:00 AM PDT. Last updated Mon Oct 21 at 10:28 AM PDT. (DBC-64961)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-64961.html",
    "Location": "Highway 1 (TransCanada Highway), between Coburn St and Shuswap Ave for 0.7 km (Chase)",
    "Description": "Construction work with blasting, road closed intermittently, speed reduction to 60km/hr. Watch for traffic control.",
    "Next update time": "Mon Nov 25 at 10:00 AM PDT",
    "Last update time": "Mon Oct 21 at 10:28 AM PDT",
    "latitude": 50.820462,
    "longitude": -119.686908
  },
  {
    "title": "Highway 1 Both Directions",
    "description": "Highway 1 (TransCanada Highway), in both directions. Bridge maintenance planned between Crazy Ck. Bridge and Enchanted Forest Ftg Rd for 6.2 km (29 km east of Sicamous to 29 km west of Revelstoke). Starting Thu Nov 14 at 7:00 AM PST until Thu Nov 14 at 5:00 PM PST. Single lane alternating traffic will be in effect. Watch for traffic control personnel. Speed reduction to 50 km/h. Next update time Thu Nov 14 at 5:00 PM PST. Last updated Mon Nov 4 at 6:45 PM PST. (DBC-69955)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-69955.html",
    "Location": "Highway 1 (TransCanada Highway), between Crazy Ck. Bridge and Enchanted Forest Ftg Rd, 29 km east of Sicamous to 29 km west of Revelstoke",
    "Description": "Bridge maintenance planned, single lane alternating traffic with speed reduction to 50 km/h. Watch for traffic control personnel.",
    "Next update time": "Thu Nov 14 at 5:00 PM PST",
    "Last update time": "Mon Nov 4 at 6:45 PM PST",
    "latitude": 50.8377865,
    "longitude": -118.9766959
  },
  {
    "title": "Highway 1 Both Directions",
    "description": "Highway 1 (TransCanada Highway), in both directions. Blasting planned between Griffin Lake Avalanche Gate and Clanwilliam OH Bridge for 15.4 km (9 to 24 km west of Revelstoke). Starting Thu Nov 21 at 10:00 AM PDT until Thu Nov 21 at 12:00 PM PDT. Road closure planned. Expect delays. Next update time Thu Nov 21 at 12:00 PM PDT. Last updated Fri Nov 1 at 5:19 PM PDT. (DBC-69823)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-69823.html",
    "Location": "Highway 1 (TransCanada Highway), between Griffin Lake Avalanche Gate and Clanwilliam OH Bridge, 9 to 24 km west of Revelstoke",
    "Description": "Blasting planned for 15.4 km section, road closure expected with delays",
    "Next update time": "Thu Nov 21 at 12:00 PM PDT",
    "Last update time": "Fri Nov 1 at 5:19 PM PDT",
    "latitude": 50.998115,
    "longitude": -118.195672
  },
  {
    "title": "Highway 1",
    "description": "Highway 1 (TransCanada Highway). Road construction work between Illecillewaet Brake Check and MacDonald Snowshed for 3.0 km (5 to 2 km west of West Boundary of Glacier National Park). Until Sat Nov 9. 2-hour closure from 6:00am-8:00am and 30-minute closures from 8:00am-6:00pm daily. Emergency vehicle access open. Next update time Sat Nov 9 at 6:00 PM PDT. Last updated Thu Oct 31 at 2:49 PM PDT. (DBC-68375)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-68375.html",
    "Location": "Highway 1 (TransCanada Highway) between Illecillewaet Brake Check and MacDonald Snowshed, 5 to 2 km west of West Boundary of Glacier National Park",
    "Description": "Road construction work with 2-hour closures from 6:00am-8:00am and 30-minute closures from 8:00am-6:00pm daily. Emergency vehicle access open.",
    "Next update time": "Sat Nov 9 at 6:00 PM PDT",
    "Last update time": "Thu Oct 31 at 2:49 PM PDT"
  },
  {
    "title": "Highway 101 Both Directions",
    "description": "Highway 101, in both directions. Special event planned between Alberni St and Duncan St for 0.9 km (Powell River). Starting Sun Dec 1 at 2:00 PM PDT until Sun Dec 1 at 5:00 PM PDT. Road closure planned. The annual Santa Claus Parade will be taking place. Next update time Sun Dec 1 at 5:00 PM PDT. Last updated Fri Oct 25 at 12:04 PM PDT. (DBC-69604)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-69604.html",
    "Location": "Highway 101, between Alberni St and Duncan St for 0.9 km (Powell River)",
    "Description": "Road closure planned for the annual Santa Claus Parade",
    "Next update time": "Sun Dec 1 at 5:00 PM PDT",
    "Last update time": "Fri Oct 25 at 12:04 PM PDT",
    "latitude": 49.8464829,
    "longitude": -124.5169267
  },
  {
    "title": "Highway 17 Both Directions",
    "description": "Highway 17 (Patricia Bay Highway), in both directions. Construction work at Exit 18: Keating Cross Rd (Central Saanich). Until Tue Jul 1, 2025. Nighttime lane closures both directions. Access to Barbara Drive from Keating Cross Road and access to East Saanich, Martindale and Danica from Highway 17 permanently closed. Keating Cross Road southbound onramp to Highway 17 closed. Next update time Sat May 10, 2025 at 12:00 PM PDT. Last updated Thu Sep 26 at 12:08 PM PDT. (DBC-54341)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-54341.html",
    "Location": "Highway 17 (Patricia Bay Highway), Exit 18: Keating Cross Rd (Central Saanich)",
    "Description": "Construction work with nighttime lane closures in both directions. Access to Barbara Drive from Keating Cross Road and access to East Saanich, Martindale, and Danica from Highway 17 permanently closed. Keating Cross Road southbound onramp to Highway 17 closed.",
    "Next update time": "Sat May 10, 2025 at 12:00 PM PDT",
    "Last update time": "Thu Sep 26 at 12:08 PM PDT",
    "latitude": 48.5813753,
    "longitude": -123.3998564
  },
  {
    "title": "Highway 23 Both Directions",
    "description": "Highway 23, in both directions. Bridge maintenance planned between Downie Ck. Bridge and Big Mouth Ck. Bridge for 54.0 km (25 km south of Mica Dam to 59 km north of Revelstoke). Starting Wed Nov 13 at 7:00 AM PST until Wed Nov 13 at 5:00 PM PST. Single lane alternating traffic will be in effect. 50 km/h speed reduction. Next update time Wed Nov 13 at 5:00 PM PST. Last updated Mon Nov 4 at 6:51 PM PST. (DBC-69954)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-69954.html",
    "Location": "Highway 23, between Downie Ck. Bridge and Big Mouth Ck. Bridge, 25 km south of Mica Dam to 59 km north of Revelstoke",
    "Description": "Bridge maintenance planned, single lane alternating traffic, 50 km/h speed reduction",
    "Next update time": "Wed Nov 13 at 5:00 PM PST",
    "Last update time": "Mon Nov 4 at 6:51 PM PST",
    "latitude": 50.998115,
    "longitude": -118.195672
  },
  {
    "title": "Highway 8 Both Directions",
    "description": "Highway 8, in both directions. Geotechnical investigation between the start of Highway 8 and 14 Mile Ranch Rd for 2.4 km (9 to 11 km east of Spences Bridge). Until Sat Nov 23 at 5:00 PM PDT. Single lane alternating traffic. Watch for traffic control. Expect delays. Next update time Sat Nov 23 at 5:00 PM PDT. Last updated Tue Oct 29 at 4:12 PM PDT. (DBC-69631)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-69631.html",
    "Location": "Highway 8, between the start of Highway 8 and 14 Mile Ranch Rd, 9 to 11 km east of Spences Bridge",
    "Description": "Geotechnical investigation causing single lane alternating traffic. Watch for traffic control and expect delays.",
    "Next update time": "Sat Nov 23 at 5:00 PM PDT",
    "Last update time": "Tue Oct 29 at 4:12 PM PDT",
    "latitude": 50.30072149999999,
    "longitude": -121.1895532
  },
  {
    "title": "Highway 93",
    "description": "Highway 93. Construction work between Radium Hill Rd and Stanley St (1 km south of Radium Hot Springs). Until Fri Nov 15. From 7:00 AM to 6:00 PM MDT on weekdays and Saturday. Lane Closure. Speed reduced to 50 km/hr. Next update time Mon Nov 11. Last updated Thu Oct 31 at 6:54 AM MDT. (DBC-65247)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-65247.html",
    "Location": "Highway 93, between Radium Hill Rd and Stanley St (1 km south of Radium Hot Springs)",
    "Description": "Construction work with lane closure and speed reduced to 50 km/hr",
    "Next update time": "Mon Nov 11",
    "Last update time": "Thu Oct 31 at 6:54 AM MDT",
    "latitude": 50.602855,
    "longitude": -116.0530696
  },
  {
    "title": "Highway 97 Both Directions",
    "description": "Highway 97, in both directions. Landslide between Callan Rd and N Beach Rd for 1.5 km (2 to 1 km north of Summerland). Road open to traffic. Expect delays under 5 minutes. Next update time Wed Nov 13 at 12:30 PM PDT. Last updated Tue Oct 8 at 10:24 AM PDT. (DBC-55794)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-55794.html",
    "Location": "Highway 97, between Callan Rd and N Beach Rd, 1.5 km north of Summerland",
    "Description": "Landslide, road open to traffic, expect delays under 5 minutes",
    "Next update time": "Wed Nov 13 at 12:30 PM PDT",
    "Last update time": "Tue Oct 8 at 10:24 AM PDT",
    "latitude": 49.6723449,
    "longitude": -119.7096726
  },
  {
    "title": "Highway 97 Both Directions",
    "description": "Highway 97, in both directions. Road construction work between Park Ave and Renfrew Rd for 7.4 km (Peachland). Until Sat Nov 9 at 7:00 PM PST. Watch for traffic control. Watch for slow moving vehicles and equipment. Next update time Sat Nov 9 at 7:00 PM PST. Last updated Mon Nov 4 at 6:18 PM PST. (DBC-69953)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-69953.html",
    "Location": "Highway 97, in both directions between Park Ave and Renfrew Rd for 7.4 km (Peachland)",
    "Description": "Road construction work. Watch for traffic control. Watch for slow moving vehicles and equipment.",
    "Next update time": "Sat Nov 9 at 7:00 PM PST",
    "Last update time": "Mon Nov 4 at 6:18 PM PST",
    "latitude": 49.7515853,
    "longitude": -119.7590808
  },
  {
    "title": "Highway 97C Both Directions",
    "description": "Highway 97C (Okanagan Connector), in both directions. Road construction work between Junction Hwy 97 and Pennask Summit for 33.0 km (West Kelowna to Pennask Summit). Until Tue Nov 12 at 7:00 PM PST. Watch for traffic control. Watch for slow moving vehicles and equipment on the road. Next update time Tue Nov 12 at 7:00 PM PST. Last updated Mon Nov 4 at 5:58 PM PST. (DBC-69950)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-69950.html",
    "Location": "Highway 97C (Okanagan Connector), in both directions. Road construction work between Junction Hwy 97 and Pennask Summit for 33.0 km (West Kelowna to Pennask Summit)",
    "Description": "Watch for traffic control. Watch for slow moving vehicles and equipment on the road.",
    "Next update time": "Tue Nov 12 at 7:00 PM PST",
    "Last update time": "Mon Nov 4 at 5:58 PM PST",
    "latitude": 49.8453262,
    "longitude": -119.6032618
  },
  {
    "title": "Kootenay Lake Ferry",
    "description": "Kootenay Lake Ferry. Ferry is out of service between Balfour and Kootenay Bay. Schedule modification due to crewing issue. Monday - Friday Essential Service sailings from Balfour at 6:30AM, 8:10AM, 4:30PM, from Kootenay Bay at 7:10AM, 9AM, 5:20PM. Passage only for Essential Service travelers. All weekend and holiday sailings cancelled. Emergency service sailings accommodated. Next update time Tue Nov 12 at 9:00 AM PST. Last updated Fri Nov 8 at 12:27 PM PST. (DBC-69872)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-69872.html",
    "Location": "Kootenay Lake Ferry, between Balfour and Kootenay Bay",
    "Description": "Ferry is out of service due to crewing issue. Modified schedule with Essential Service sailings on weekdays. Passage only for Essential Service travelers. Weekend and holiday sailings cancelled. Emergency service sailings accommodated.",
    "Next update time": "Tue Nov 12 at 9:00 AM PST",
    "Last update time": "Fri Nov 8 at 12:27 PM PST",
    "latitude": 49.678417,
    "longitude": -116.870564
  },
  {
    "title": "Other Roads Both Directions",
    "description": "Soda-Creek Macalister Road, in both directions. Landslide at 10 kms from the Junction of Highway 97. Road closed. Geotech assessment underway. Next update time Fri Feb 21, 2025 at 2:00 PM PDT. Last updated Mon Aug 26 at 2:45 PM PDT. (DBC-16911)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-16911.html",
    "Location": "Soda-Creek Macalister Road, in both directions, 10 kms from the Junction of Highway 97",
    "Description": "Landslide, road closed. Geotech assessment underway.",
    "Next update time": "Fri Feb 21, 2025 at 2:00 PM PDT",
    "Last update time": "Mon Aug 26 at 2:45 PM PDT"
  },
  {
    "title": "Other Roads",
    "description": "Kersley-Dale Landing Rd. Landslide at 500 metres in from Highway 97 Intersection. Road closed. A temporary Single Lane Gravel Road for Local Traffic via Arnoldus Road. Next update time Mon Dec 9 at 9:00 AM PDT. Last updated Thu Aug 8 at 9:26 AM PDT. (DBC-23443)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-23443.html",
    "Location": "Kersley-Dale Landing Rd. at 500 metres in from Highway 97 Intersection",
    "Description": "Landslide, road closed. Temporary Single Lane Gravel Road for Local Traffic via Arnoldus Road",
    "Next update time": "Mon Dec 9 at 9:00 AM PDT",
    "Last update time": "Thu Aug 8 at 9:26 AM PDT",
    "latitude": 54.6985492,
    "longitude": -122.7918979
  },
  {
    "title": "Other Roads Both Directions",
    "description": "Durrell Road, in both directions. Landslide at 700m from Highway 97. Road closed. Detour in effect. Detour available via Highway 97 and Dale Lake Road. Next update time Wed Apr 23, 2025 at 2:00 PM PDT. Last updated Wed Oct 23 at 1:06 PM PDT. (DBC-27390)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-27390.html",
    "Location": "Durrell Road, 700m from Highway 97",
    "Description": "Landslide, road closed. Detour available via Highway 97 and Dale Lake Road.",
    "Next update time": "Wed Apr 23, 2025 at 2:00 PM PDT",
    "Last update time": "Wed Oct 23 at 1:06 PM PDT",
    "latitude": 43.8437379,
    "longitude": -71.2871469
  },
  {
    "title": "Other Roads Both Directions",
    "description": "Quesnel-Hixon Road, in both directions. Landslide at Cottonwood bridge. Road closed. Next update time Thu Apr 17, 2025 at 2:00 PM PDT. Last updated Wed Oct 23 at 2:46 PM PDT. (DBC-28386)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-28386.html",
    "Location": "Quesnel-Hixon Road, at Cottonwood bridge",
    "Description": "Landslide, road closed",
    "Next update time": "Thu Apr 17, 2025 at 2:00 PM PDT",
    "Last update time": "Wed Oct 23 at 2:46 PM PDT",
    "latitude": 52.9817372,
    "longitude": -122.4949058
  },
  {
    "title": "Other Roads",
    "description": "Johnston Bridge. Travel advisory in effect at Front St. In Quesnel. Johnston Bridge. Bridge is open to vehicles with gross vehicle weight rating of 10,000 kilograms or lower. Industrial traffic and heavy commercial traffic must detour via Plywood Rd and Maple Drive. Industrial traffic is not allowed to detour through Johnston Subdivision. Next update time Wed Apr 8, 2026 at 9:00 AM PDT. Last updated Thu Oct 17 at 6:39 AM PDT. (DBC-47311)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-47311.html",
    "Location": "Johnston Bridge, Front St. in Quesnel",
    "Description": "Travel advisory in effect. Bridge open to vehicles with gross vehicle weight rating of 10,000 kilograms or lower. Industrial traffic and heavy commercial traffic must detour via Plywood Rd and Maple Drive. Industrial traffic not allowed to detour through Johnston Subdivision.",
    "Next update time": "Wed Apr 8, 2026 at 9:00 AM PDT",
    "Last update time": "Thu Oct 17 at 6:39 AM PDT",
    "latitude": 52.9733808,
    "longitude": -122.4965097
  },
  {
    "title": "Other Roads Both Directions",
    "description": "McKay Road, in both directions. Flooding at McKay Road. Road closed. Next update time Mon Dec 9 at 9:00 AM PDT. Last updated Thu Aug 8 at 9:26 AM PDT. (DBC-53013)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-53013.html",
    "Location": "McKay Road",
    "Description": "Flooding at McKay Road. Road closed.",
    "Next update time": "Mon Dec 9 at 9:00 AM PDT",
    "Last update time": "Thu Aug 8 at 9:26 AM PDT",
    "latitude": 44.3101597,
    "longitude": -79.6817146
  },
  {
    "title": "Other Roads Both Directions",
    "description": "Canal Rd, in both directions. Construction work at Mt Norman Access Rd. From 10:00 AM to 2:00 PM PST daily. Road closed. Watch for traffic control. Expect delays. Work to continue through long weekend. Next update time Tue Nov 12 at 3:00 PM PST. Last updated Tue Nov 5 at 3:30 PM PST. (DBC-61149)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-61149.html",
    "Location": "Canal Rd, in both directions at Mt Norman Access Rd",
    "Description": "Construction work causing road closure. Traffic control in place. Delays expected. Work to continue through long weekend.",
    "Next update time": "Tue Nov 12 at 3:00 PM PST",
    "Last update time": "Tue Nov 5 at 3:30 PM PST",
    "latitude": 48.7591586,
    "longitude": -123.2294164
  },
  {
    "title": "Other Roads Both Directions",
    "description": "Cave Road, in both directions. Landslide at Quesnel-Hixon Road. Road closed. Landslide on Cave Road. Next update time Tue Apr 1, 2025 at 10:00 AM PDT. Last updated Wed Oct 9 at 10:17 AM PDT. (DBC-67913)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-67913.html",
    "Location": "Cave Road, in both directions at Quesnel-Hixon Road",
    "Description": "Road closed due to a landslide on Cave Road",
    "Next update time": "Tue Apr 1, 2025 at 10:00 AM PDT",
    "Last update time": "Wed Oct 9 at 10:17 AM PDT",
    "latitude": 53.0738772,
    "longitude": -122.5100618
  },
  {
    "title": "Other Roads",
    "description": "Red Bridge. Bridge closed between Athabasca Street and Lorne Street 1 km north of Kamloops. Bridge damaged. Detour in effect. Detour via Highway 5. Next update time Tue Dec 31 at 12:00 PM PDT. Last updated Fri Oct 25 at 7:55 AM PDT. (DBC-68412)",
    "link": "https://www.drivebc.ca/mobile/pub/events/id/DBC-68412.html",
    "Location": "Red Bridge, 1 km north of Kamloops",
    "Description": "Bridge closed between Athabasca Street and Lorne Street due to damage. Detour in effect via Highway 5.",
    "Next update time": "Tue Dec 31 at 12:00 PM PDT",
    "Last update time": "Fri Oct 25 at 7:55 AM PDT",
    "latitude": 50.6796374,
    "longitude": -120.3250066
  }
]